<?php
/**
 * CRF字典数组
 * 需要申明：
 * 1.代码
 *   eg:数据库编号
 * 2.名称
 *   eg:中文名称
 * 3.变量类型
 *   eg:连续型(数值型)/分类型/文本型
 * 4.取值说明
 *   eg:0女;1男
 */


//01中山大学肿瘤防治中心;02中山大学第一附属医院;03中山大学第二附属医院;04中山大学第三附属医院;05中山大学第六附属医院;06广东省人民医院;07南方医科大学南方医院;08佛山市第一人民医院;09深圳市人民医院;10梅州市人民医院;11汕头大学第一附属医院;12汕头市中心医院;13福建省肿瘤医院;14厦门市第一人民医院;15广东省中医院;16广州医学院第一附属医院;17暨南大学第一附属医院;18潮州市中心医院;19广东药学院第一附属医院;20清远人民医院;21粤北人民医院;22英德人民医院;23中山大学第五附属医院;

$types[0] = '连续型(数值型)';
$types[1] = '分类型';
$types[2] = '文本型';

//第一部分：基本资料
$data_basic[] = array(
  'hospital_no',
  '中心名称',
  '1',
  '01中山大学肿瘤防治中心;02中山大学第一附属医院;03中山大学第二附属医院;04中山大学第三附属医院;05中山大学第六附属医院;06广东省人民医院;07南方医科大学南方医院;08佛山市第一人民医院;09深圳市人民医院;10梅州市人民医院;11汕头大学第一附属医院;12汕头市中心医院;13福建省肿瘤医院;14厦门市第一人民医院;15广东省中医院;16广州医学院第一附属医院;17暨南大学第一附属医院;18潮州市中心医院;19广东药学院第一附属医院;20清远人民医院;21粤北人民医院;22英德人民医院;23中山大学第五附属医院;'
);
$data_basic[] = array(
  'p_name',
  '受试者姓名缩写',
  '2',
  '患者姓名拼音缩写需填满四格，两字姓名分填两字前两个字母，三字姓名填前两字首字母与第三字前两个字母，四字姓名填每字首字母。',
);
$data_basic[] = array(
  'p_birthday',
  '受试者出生日期',
  '2',
  '格式: Y-m-d',
);
$data_basic[] = array(
  'case_history_no',
  '受试者病历号',
  '0',
);
$data_basic[] = array(
  'approved',
  '受试者是否获得知情同意书',
  '1',
  '0是;1否',
);
$data_basic[] = array(
  'approved_time',
  '知情同意日期',
  '2',
  '格式: Y-m-d',
);
$data_basic[] = array(
  'team',
  '受试者分组',
  '1',
  '1A组：S-1联合奥沙利铂;2B组：S-1单药',
);
$data_basic[] = array(
  'editor',
  '研究医生签名',
  '2',
);
$data_basic[] = array(
  'phone',
  '手机号码',
  '2',
  '提醒手机号码，通知患者随访信息，更好管理患者',
);
$data_basic[] = array(
  'phone_1',
  '第二个手机号码',
  '2',
  '第二个提醒手机号码，通知患者随访信息，更好管理患者',
);
$data_basic[] = array(
  'p_id_card',
  '身份证号码',
  '2',
  '受试者身份证号',
);

$data_crf['ruxuan_bz'] = array(
  '#name'  => '入选标准',
  1 => array(1 => array(
    '患者本人签署知情同意书', //同：受试者是否获得知情同意书
    '1',
    '1是;0否',
  )),
  2 => array(1 => array(
    '组织学证实的II期、Ⅲ期进展期胃癌患者', 
    '1',
    '1是;0否',
  )),
  3 => array(1 => array(
    '已接受D2淋巴结清除的R0切除术（无残余肿瘤）', 
    '1',
    '1是;0否',
  )),
  4 => array(1 => array(
    '无肝脏、腹膜或远处转移', 
    '1',
    '1是;0否',
  )),
  5 => array(1 => array(
    '细胞学检查在腹水中未发现肿瘤细胞', 
    '1',
    '1是;0否',
  )),
  6 => array(1 => array(
    'ECOG评分0-2分', 
    '1',
    '1是;0否',
  )),
  7 => array(1 => array(
    '年龄18-70岁', 
    '1',
    '1是;0否',
  )),
  8 => array(1 => array(
    '除原发性胃癌初治时的胃切除外，既往无癌症治疗', 
    '1',
    '1是;0否',
  )),
  9 => array(1 => array(
    '入组前血流动力学指标（包括血细胞计数、肝肾功能）正常', 
    '1',
    '1是;0否',
    '如WBC>4.0×109/L，血小板>100×109/L，胆红素<1.5倍正常参考值上限，谷草转氨酶和谷丙转氨酶肌酐<2.5倍正常参考值上限',
  )),
  10 => array(1 => array(
    '入组前心脏功能良好，半年内无心脑血管意外发作，高血压、冠心病等目前在可控制范围内', 
    '1',
    '1是;0否',
  )),
  11 => array(1 => array(
    '入组前不伴有其他不可控制的良性疾病如肺部、肾脏、肝脏疾病及感染等', 
    '1',
    '1是;0否',
  )),
  12 => array(1 => array(
    '治疗前及治疗过程中未参加其他研究项目', 
    '1',
    '1是;0否',
  )),
);

$data_crf['paichu_bz'] = array(
  '#name' => '排除标准',
  1 => array(1 => array(
    '不符合入选标准', 
    '1',
    '1是;0否',
  )),
  2 => array(1 => array(
    '入组前已经进行了其他药物治疗（包含中药）或入组后无法保证按照研究要求进行者', 
    '1',
    '1是;0否',
  )),
  3 => array(1 => array(
    '对本方案药物过敏', 
    '1',
    '1是;0否',
  )),
  4 => array(1 => array(
    '妊娠或哺乳期妇女', 
    '1',
    '1是;0否',
  )),
  5 => array(1 => array(
    '女性育龄患者，研究期间有生育要求者', 
    '1',
    '1是;0否',
  )),
);

$data_crf['renkou_tjx'] = array(
  '#name' => '人口统计学',
  1 => array(1 => array(
    '性别', 
    '1',
    '1女;0男',
  )),
);

$data_crf['weiai_ssyzdqk'] = array(
  '#name' => '胃癌手术与诊断情况',
  1 => array(1 => array(
    '胃癌首次诊断日期', 
    '2',
  )),
  2 => array(1 => array(
    '胃癌手术日期', 
    '2',
  )),
  3 => array(
    1 => array(
      '术后肿瘤分期TNM T值', 
      '1',
      '0x;10;21;32;43;54;64a;74b',
    ),
    2 => array(
      '术后肿瘤分期TNM N值', 
      '1',
      '0x;10;21;32;43;53a;63b;74',
    ),
    3 => array(
      '术后肿瘤分期TNM M值', 
      '1',
      '0x;10;21',
    ),
    4 => array(
      '术后肿瘤分期AJCC', 
      '1',
      '1IIA;2IIB;3IIIA;4IIIB;5IIIC',      
    ),
  ),
  4 => array(
    1 => array(
      '肿瘤的组织学分类', 
      '1',
      '1腺癌;2高分化;3中分化;4低分化;5未知;6印戒细胞癌;7黏液腺癌;8其它',
    ),
    2 => array(
      '肿瘤的组织学分类 其它说明', 
      '2',
    ),
  ),
  5 => array(
    1 => array(
      '肿瘤原发部位',
      '1',
      '1食管胃结合部;2胃上部;3胃中部;4胃下部;5胃上，中部;6胃中，下部;7全胃;8其它',
    ),
    2 => array(
      '肿瘤原发部位 其它说明',
      '2',
    ),
  ),
  6 => array(
    1 => array(
      '淋巴结转移情况 送检淋巴结数量', 
      '0',
    ),
    2 => array(
      '淋巴结转移情况 其中第一站淋巴结', 
      '0',
    ),
    3 => array(
      '淋巴结转移情况 第二站', 
      '0',
    ),
    4 => array(
      '淋巴结转移情况 阳性淋巴结数量', 
      '0',
    ),
    5 => array(
      '淋巴结转移情况 其中第一站淋巴结', 
      '0',
    ),
    6 => array(
      '淋巴结转移情况 第二站', 
      '0',
    ),
  ),
  7 => array(
    1 => array(
      '分子生物学检测（肿瘤组织） HER2 IHC方法', 
      '1',
      '0－、＋、＋/－;1＋＋;2＋＋＋'
    ),
    2 => array(
      '分子生物学检测（肿瘤组织） HER2 FISH方法', 
      '1',
      '0阳性;1阴性'
    ),
    3 => array(
      '分子生物学检测（肿瘤组织） VEGF 检测方法', 
      '0',
    ),
    3 => array(
      '分子生物学检测（肿瘤组织） VEGF 检测结果', 
      '1',
      '0阳性;1阴性 '
    ),
  ),
);

$data_crf['jiwang_hxhjb'] = array(
  '#name' => '既往或现患疾病',
  1 => array(
      1 => array(
          '是否有',
          '1',
          '0无1有'
      )
  ),
  2 => array(
      1 => array(
          '医学事件/疾病 1',
          '0'
      ),
      2 => array(
          '入组时仍存在 1',
          '1',
          '1是;0否'
      ),
      3 => array(
          '诊断日期 1',
          '2',
      )
  ),
  3 => array(
    1 => array(
      '医学事件/疾病 2',
      '0'
    ),
    2 => array(
      '入组时仍存在 2',
      '1',
      '1是;0否'
    ),
    3 => array(
      '诊断日期 2',
      '2',
    )
  ),
  4 => array(
    1 => array(
      '医学事件/疾病 3',
      '0'
    ),
    2 => array(
      '入组时仍存在 3',
      '1',
      '1是;0否'
    ),
    3 => array(
      '诊断日期 3',
      '2',
    )
  ),
);

$data_crf['huaiyun_knx'] = array(
  '#name' => '怀孕可能性',
  1 => array(
    1 => array(
      '受试者是否进行尿妊娠试验',
      '1',
      '0是;1否;2不适用'
    ), 
    2 => array(
      '受试者不适用进行尿妊娠试验的原因',
      '2',
    ), 
  ),
  2 => array(
    1 => array(
      '尿妊娠试验结果',
      '1',
      '0阴性;2阳性',
      '育龄期妇女，请在试验前48小时内完成尿妊娠试验检查，并且试验期间受试者必须采取充分的避孕措施。'
    ), 
  ), 
);

$data_crf['teshu_jc'] = array(
  '#name' => '特殊检查',
    1 => array(
        1 => array(
            '胸部X线检查/评估日期',
            '2',
        ), 
        2 => array(
            '胸部X线检查/是否做',
            '1',
            '1未做'
        ), 
        3 => array(
            '胸部X线检查/是否涉及肿瘤',
            '1',
            '1是;0否'
        ), 
        4 => array(
            '胸部X线检查/说明(仅当必要时)',
            '2',
        )
    ),
    2 => array(
        1 => array(
            '腹部CT检查/评估日期',
            '2',
        ), 
        2 => array(
            '腹部CT检查/是否做',
            '1',
            '1未做'
        ), 
        3 => array(
            '腹部CT检查/是否涉及肿瘤',
            '1',
            '1是;0否'
        ), 
        4 => array(
            '腹部CT检查/说明(仅当必要时)',
            '2',
        )
    ),
    3 => array(
        1 => array(
            '腹部MRI/评估日期',
            '2',
        ), 
        2 => array(
            '腹部MRI/是否做',
            '1',
            '1未做'
        ), 
        3 => array(
            '腹部MRI/是否涉及肿瘤',
            '1',
            '1是;0否'
        ), 
        4 => array(
            '腹部MRI/说明(仅当必要时)',
            '2',
        )
    ),
    4 => array(
        1 => array(
            '盆腔CT检查/评估日期',
            '2',
        ), 
        2 => array(
            '盆腔CT检查/是否做',
            '1',
            '1未做'
        ), 
        3 => array(
            '盆腔CT检查/是否涉及肿瘤',
            '1',
            '1是;0否'
        ), 
        4 => array(
            '盆腔CT检查/说明(仅当必要时)',
            '2',
        )
    ),
    5 => array(
        1 => array(
            '盆腔MRI/评估日期',
            '2',
        ), 
        2 => array(
            '盆腔MRI/是否做',
            '1',
            '1未做'
        ), 
        3 => array(
            '盆腔MRI/是否涉及肿瘤',
            '1',
            '1是;0否'
        ), 
        4 => array(
            '盆腔MRI/说明(仅当必要时)',
            '2',
        )
    ),
    6 => array(
        1 => array(
            '胸部CT检查/评估日期',
            '2',
        ), 
        2 => array(
            '胸部CT检查/是否做',
            '1',
            '1未做'
        ), 
        3 => array(
            '胸部CT检查/是否涉及肿瘤',
            '1',
            '1是;0否'
        ), 
        4 => array(
            '胸部CT检查/说明(仅当必要时)',
            '2',
        )    
    ),
    7 => array(
        1 => array(
            '胸部MRI/评估日期',
            '2',
        ), 
        2 => array(
            '胸部MRI/是否做',
            '1',
            '1未做'
        ), 
        3 => array(
            '胸部MRI/是否涉及肿瘤',
            '1',
            '1是;0否'
        ), 
        4 => array(
            '胸部MRI/说明(仅当必要时)',
            '2',
        )
    ),
    8 => array(
        1 => array(
            '头颅CT检查/评估日期',
            '2',
        ), 
        2 => array(
            '头颅CT检查/是否做',
            '1',
            '1未做'
        ), 
        3 => array(
            '头颅CT检查/是否涉及肿瘤',
            '1',
            '1是;0否'
        ), 
        4 => array(
            '头颅CT检查/说明(仅当必要时)',
            '2',
        )
    ),
    9 => array(
        1 => array(
            '头颅MRI/评估日期',
            '2',
        ), 
        2 => array(
            '头颅MRI/是否做',
            '1',
            '1未做'
        ), 
        3 => array(
            '头颅MRI/是否涉及肿瘤',
            '1',
            '1是;0否'
        ), 
        4 => array(
            '头颅MRI/说明(仅当必要时)',
            '2',
        )
    ),
    10 => array(
        1 => array(
            '骨扫描/评估日期',
            '2',
        ), 
        2 => array(
            '骨扫描/是否做',
            '1',
            '1未做'
        ), 
        3 => array(
            '骨扫描/是否涉及肿瘤',
            '1',
            '1是;0否'
        ), 
        4 => array(
            '骨扫描/说明(仅当必要时)',
            '2',
        )
    ),
    11 => array(
        1 => array(
            '全身PET/CT/评估日期',
            '2',
        ), 
        2 => array(
            '全身PET/CT/是否做',
            '1',
            '1未做'
        ), 
        3 => array(
            '全身PET/CT/是否涉及肿瘤',
            '1',
            '1是;0否'
        ), 
        4 => array(
            '全身PET/CT/说明(仅当必要时)',
            '2',
        )
    ),
    12 => array(
        1 => array(
            '其它，详细说明1',
            '2',
        ), 
        2 => array(
            '其它，详细说明1/评估日期',
            '2',
        ), 
        3 => array(
            '其它，详细说明1/是否做',
            '1',
            '1未做'
        ), 
        4 => array(
            '其它，详细说明1/是否涉及肿瘤',
            '1',
            '1是;0否'
        ), 
        5 => array(
            '其它，详细说明1/说明(仅当必要时)',
            '2',
        )
    ),
    13 => array(
        1 => array(
            '其它，详细说明2',
            '2',
        ), 
        2 => array(
            '其它，详细说明2/评估日期',
            '2',
        ), 
        3 => array(
            '其它，详细说明2/是否做',
            '1',
            '1未做'
        ), 
        4 => array(
            '其它，详细说明2/是否涉及肿瘤',
            '1',
            '1是;0否'
        ), 
        5 => array(
            '其它，详细说明2/说明(仅当必要时)',
            '2',
        )
    ),
    14 => array(
        1 => array(
            '其它，详细说明3',
            '2',
        ), 
        2 => array(
            '其它，详细说明3/评估日期',
            '2',
        ), 
        3 => array(
            '其它，详细说明3/是否做',
            '1',
            '1未做'
        ), 
        4 => array(
            '其它，详细说明3/是否涉及肿瘤',
            '1',
            '1是;0否'
        ), 
        5 => array(
            '其它，详细说明3/说明(仅当必要时)',
            '2',
        )
    ),
);

$data_crf['xindian_tjc'] = array(
  '#name' => '心电图检查',
    1 => array(
        1 => array(
            '检查日期',
            '2'
        )
    ),
    2 => array(
        1 => array(
            '检查是否正常',
            '1',
            '0正常1异常'
        ), 
        2 => array(
            '检查说明',
            '2'
        )
   ),
);

$data_crf['quanshen_tgjc'] = array(
  '#name' => '全身体格检查',
    1 => array(
        1 => array(
            '检查日期',
            '2',
        )
    ),
    2 => array(
        1 => array(
            '体重',
            '0',
        ), 
        2 => array(
            '身高',
            '0'
        )
    ),
    3 => array(
        1 => array(
            '过去3月内体重减轻',
            '0'
        ), 
        2 => array(
            '体表面积',
            '0'
        )
    ),
    4 => array(
        1 => array(
            '血压',
            '0'
        ), 
        2 => array(
            '血压',
            '0'
        ), 
        3 => array(
            'ECOG PS评分',
            '2',
            '00;11;22'
        )
    ),
    5 => array(
        1 => array(
            '检查项目/一般状况',
            '1',
            '0正常;1异常'
        ), 
        2 => array(
            '检查项目/一般状况有异常的说明',
            '2'
        )
    ),
    6 => array(
        1 => array(
            '检查项目/头（面）部',
            '1',
            '0正常;1异常'
        ), 
        2 => array(
            '检查项目/头（面）部有异常的说明',
            '2'
        )
    ), 
    7 => array(
        1 => array(
            '检查项目/皮肤',
            '1',
            '0正常;1异常'
        ), 
        2 => array(
            '检查项目/皮肤有异常的说明',
            '2'
        )
    ),
    8 => array(
        1 => array(
            '检查项目/淋巴结',
            '1',
            '0正常;1异常'
        ), 
        2 => array(
            '检查项目/淋巴结有异常的说明',
            '2'
        )
    ),
    9 => array(
        1 => array(
            '检查项目/口腔',
            '1',
            '0正常;1异常'
        ), 
        2 => array(
            '检查项目/口腔有异常的说明',
            '2'
        )
    ),
    10 => array(
        1 => array(
            '检查项目/呼吸系统',
            '1',
            '0正常;1异常'
        ), 
        2 => array(
            '检查项目/呼吸系统有异常的说明',
            '2'
        )
    ),
    11 => array(
        1 => array(
            '检查项目/心血管系统',
            '1',
            '0正常;1异常'
        ), 
        2 => array(
            '检查项目/心血管系统有异常的说明',
            '2'
        )
    ),
    12 => array(
        1 => array(
            '检查项目/腹部（包括肝脾）',
            '1',
            '0正常;1异常'
        ), 
        2 => array(
            '检查项目/腹部（包括肝脾）有异常的说明',
            '2'
        )
    ),
    13 => array(
        1 => array(
            '检查项目/生殖-泌尿系统',
            '1',
            '0正常;1异常'
        ), 
        2 => array(
            '检查项目/生殖-泌尿系统有异常的说明',
            '2'
        )
    ),
    14 => array(
        1 => array(
            '检查项目/肌肉骨骼',
            '1',
            '0正常;1异常'
        ), 
        2 => array(
            '检查项目/肌肉骨骼有异常的说明',
            '2'
        )
    ),
    15 => array(
        1 => array(
            '检查项目/神经系统',
            '1',
            '0正常;1异常'
        ), 
        2 => array(
            '检查项目/神经系统有异常的说明',
            '2'
        )
    ),
    16 => array(
        1 => array(
            '检查项目/精神状况',
            '1',
            '0正常;1异常'
        ), 
        2 => array(
            '检查项目/精神状况有异常的说明',
            '2'
        )
    ),
);

$data_crf['xueqing_zlbzwjc'] = array(
  '#name' => '血清肿瘤标志物检测',
    1 => array(
        1 => array(
            '取样日期',
            '2',
        )
    ),
    2 => array(
        1 => array(
            'CEA是否做',
            '1',
            '1未做'
        ), 
        2 => array(
            'CEA数值',
            '0',
        ), 
        3 => array(
            'CEA单位',
            '1',
            '0ng/ml;1其它'
        ), 
        4 => array(
            'CEA其它单位说明',
            '2',
        )
    ),
    3 => array(
        1 => array(
            'CA19-9是否做',
            '1',
            '1未做'
        ), 
        2 => array(
            'CA19-9数值',
            '0',
        ), 
        3 => array(
            'CA19-9单位',
            '1',
            '0ng/ml;1其它'
        ), 
        4 => array(
            'CA19-9其它单位说明',
            '2',
        )
    ),
    4 => array(
        1 => array(
            'CA724是否做',
            '1',
            '1未做'
        ), 
        2 => array(
            'CA724数值',
            '0',
        ), 
        3 => array(
            'CA724单位',
            '1',
            '0ng/ml;1其它'
        ), 
        4 => array(
            'CA724其它单位说明',
            '2',
        )
    ),
);

$data_crf['shiyan_sjc'] = array(
  '#name' => '实验室检查',
    1 => array(
        1 => array(
            '血常规取样日期',
            '2'
        )
    ),
    2 => array(
        1 => array(
            '白细胞计数WBC/数值',
            '0'
        ), 
        2 => array(
            '白细胞计数WBC/单位',
            '1',
            '0x10<sup>3</sup>/mm<sup>3</sup>;1x10<sup>9</sup>/L'
        ), 
        3 => array(
            '白细胞计数WBC/是否有临床意义',
            '1',
            '1是;0否'
        )
    ),
    3 => array(
        1 => array(
            '中性粒细胞计数ANC/数值',
            '0'
        ), 
        2 => array(
            '中性粒细胞计数ANC/单位',
            '1',
            '0x10<sup>3</sup>/mm<sup>3</sup>;1x10<sup>9</sup>/L'
        ), 
        3 => array(
            '中性粒细胞计数ANC/是否有临床意义',
            '1',
            '1是;0否'
        )
    ),
    4 => array(
        1 => array(
            '血红蛋白HGB/数值',
            '0'
        ), 
        2 => array(
            '血红蛋白HGB/单位',
            '1',
            '0mg/dl;1g/L'
        ), 
        3 => array(
            '血红蛋白HGB/是否有临床意义',
            '1',
            '1是;0否'
        )
    ),
    5 => array(
        1 => array(
            '红细胞计数RBC/数值',
            '0'
        ), 
        2 => array(
            '红细胞计数RBC/单位',
            '1',
            '0x10<sup>3</sup>/mm<sup>3</sup>;1x10<sup>12</sup>/L'
        ), 
        3 => array(
            '红细胞计数RBC/是否有临床意义',
            '1',
            '1是;0否'
        )
    ),
    6 => array(
        1 => array(
            '红细胞压积/数值',
            '0'
        ), 
        2 => array(
            '红细胞压积/是否有临床意义',
            '1',
            '1是;0否'
        )
    ),
    7 => array(
        1 => array(
            '血小板计数PLT/数值',
            '0'
        ), 
        2 => array(
            '血小板计数PLT/单位',
            '1',
            '0x10<sup>3</sup>/mm<sup>3</sup>;1x10<sup>12</sup>/L'
        ), 
        3 => array(
            '血小板计数PLT/是否有临床意义',
            '1',
            '1是;0否'
        )
    ),
    8 => array(
        1 => array(
            '凝血功能取样日期',
            '2'
        )
    ),
    9 => array(
        1 => array(
            'INR(华法令治疗者须查)/数值',
            '0'
        ), 
        2 => array(
            'INR(华法令治疗者须查)/是否有临床意义',
            '1',
            '1是;0否'
        )
    ),
    10 => array(
        1 => array(
            '血生化取样日期',
            '2'
        )
    ),
    11 => array(
        1 => array(
            '总胆红素TBIL/数值',
            '0'
        ), 
        2 => array(
            '总胆红素TBIL/单位',
            '1',
            '0μmol/L;1mg/dL;2其它'
        ), 
        3 => array(
            '总胆红素TBIL/其它单位说明',
            '2'
        ), 
        4 => array(
            '总胆红素TBIL/是否有临床意义',
            '1',
            '1是;0否'
        )
    ),
    12 => array(
        1 => array(
            '直接胆红素DB/数值',
            '0'
        ), 
        2 => array(
            '直接胆红素DB/单位',
            '1',
            '0μmol/L;1mg/dL;2其它'
        ), 
        3 => array(
            '直接胆红素DB/其它单位说明',
            '2'
        ), 
        4 => array(
            '直接胆红素DB/是否有临床意义',
            '1',
            '1是;0否'
        )
    ),
    13 => array(
        1 => array(
            '谷丙转氨酶ALT/数值',
            '0'
        ), 
        2 => array(
            '谷丙转氨酶ALT/单位',
            '1',
            '0U/L;1μkat/L;2其它'
        ), 
        3 => array(
            '谷丙转氨酶ALT/其它单位说明',
            '2'
        ), 
        4 => array(
            '谷丙转氨酶ALT/是否有临床意义',
            '1',
            '1是;0否'
        )
    ),
    14 => array(
        1 => array(
            '谷草转氨酶AST/数值',
            '0'
        ), 
        2 => array(
            '谷草转氨酶AST/单位',
            '1',
            '0U/L;1μkat/L;2其它'
        ), 
        3 => array(
            '谷草转氨酶AST/其它单位说明',
            '2'
        ), 
        4 => array(
            '谷草转氨酶AST/是否有临床意义',
            '1',
            '1是;0否'
        )
    ),
    15 => array(
        1 => array(
            '总蛋白TP/数值',
            '0'
        ), 
        2 => array(
            '总蛋白TP/单位',
            '1',
            '0mg/dL;1g/L;2其它'
        ), 
        3 => array(
            '总蛋白TP/其它单位说明',
            '2'
        ), 
        4 => array(
            '总蛋白TP/是否有临床意义',
            '1',
            '1是;0否'
        )
    ),
    16 => array(
        1 => array(
            '白蛋白ALB/数值',
            '0'
        ), 
        2 => array(
            '白蛋白ALB/单位',
            '1',
            '0mg/dL;1g/L;2其它'
        ), 
        3 => array(
            '白蛋白ALB/其它单位说明',
            '2'
        ), 
        4 => array(
            '白蛋白ALB/是否有临床意义',
            '1',
            '1是;0否'
        )
    ),
    17 => array(
        1 => array(
            '碱性磷酸酶ALP/数值',
            '0'
        ), 
        2 => array(
            '碱性磷酸酶ALP/单位',
            '1',
            '0U/L;1μkat/L;2其它'
        ), 
        3 => array(
            '碱性磷酸酶ALP/其它单位说明',
            '2'
        ), 
        4 => array(
            '碱性磷酸酶ALP/是否有临床意义',
            '1',
            '1是;0否'
        )
    ),
    18 => array(
        1 => array(
            '乳酸脱氢酶LDH/数值',
            '0'
        ), 
        2 => array(
            '乳酸脱氢酶LDH/单位',
            '1',
            '0U/L;1μkat/L;2其它'
        ), 
        3 => array(
            '乳酸脱氢酶LDH/其它单位说明',
            '2'
        ), 
        4 => array(
            '乳酸脱氢酶LDH/是否有临床意义',
            '1',
            '1是;0否'
        )
    ),
    19 => array(
        1 => array(
            '尿素BUN/数值',
            '0'
        ), 
        2 => array(
            '尿素BUN/单位',
            '1',
            '0mmol/L;1mg/L;2其它'
        ), 
        3 => array(
            '尿素BUN/其它单位说明',
            '2'
        ), 
        4 => array(
            '尿素BUN/是否有临床意义',
            '1',
            '1是;0否'
        )
    ),
    20 => array(
        1 => array(
            '肌酐CRE/数值',
            '0'
        ), 
        2 => array(
            '肌酐CRE/单位',
            '1',
            '0μmol/L;1mg/dL;2其它'
        ), 
        3 => array(
            '肌酐CRE/其它单位说明',
            '2'
        ), 
        4 => array(
            '肌酐CRE/是否有临床意义',
            '1',
            '1是;0否'
        )
    ),
    21 => array(
        1 => array(
            '肌酐清除率Ccr/数值',
            '0'
        ), 
        2 => array(
            '肌酐清除率Ccr/单位',
            '1',
            '0ml/min;1其它'
        ), 
        3 => array(
            '肌酐清除率Ccr/其它单位说明',
            '2'
        ), 
        4 => array(
            '肌酐清除率Ccr/是否有临床意义',
            '1',
            '1是;0否'
        )
    ),
    22 => array(
        1 => array(
            '钾K+/数值',
            '0'
        ), 
        2 => array(
            '钾K+/单位',
            '1',
            '0mmol/L;1其它'
        ), 
        3 => array(
            '钾K+/其它单位说明',
            '2'
        ), 
        4 => array(
            '钾K+/是否有临床意义',
            '1',
            '1是;0否'
        )
    ),
    23 => array(
        1 => array(
            '钠Na+/数值',
            '0'
        ), 
        2 => array(
            '钠Na+/单位',
            '1',
            '0mmol/L;1其它'
        ), 
        3 => array(
            '钠Na+/其它单位说明',
            '2'
        ), 
        4 => array(
            '钠Na+/是否有临床意义',
            '1',
            '1是;0否'
        )
    ),
    24 => array(
        1 => array(
            '钙Ca2+/数值',
            '0'
        ), 
        2 => array(
            '钙Ca2+/单位',
            '1',
            '0mmol/L;1其它'
        ), 
        3 => array(
            '钙Ca2+/其它单位说明',
            '2'
        ), 
        4 => array(
            '钙Ca2+/是否有临床意义',
            '1',
            '1是;0否'
        )
    ),
    25 => array(
        1 => array(
            '尿常规 取样日期',
            '2'
        )
    ),
    26 => array(
        1 => array(
            '尿蛋白/数值',
            '0'
        ), 
        2 => array(
            '尿蛋白/单位',
            '1',
            '0mmol/L;1其它'
        ), 
        3 => array(
            '尿蛋白/其它单位说明',
            '2'
        ), 
        4 => array(
            '尿蛋白/是否有临床意义',
            '1',
            '1是;0否'
        )
    ),
);

$data_crf['zq1_1'] = array(
  '#name' => '第一周期/研究给药',
    1 => array(
        1 => array(
            '研究药物 S-1/给药起始日期',
            '2'
        ), 
        2 => array(
            '研究药物 S-1/给药结束日期',
            '2'
        ), 
        3 => array(
            '研究药物 S-1计划剂量(mg)',
            '1',
            '040;150;250'
        ), 
        4 => array(
            '研究药物 S-1总给药剂量(mg)',
            '0'
        )
    ),
    2 => array(
        1 => array(
            '研究药物 奥沙利铂/是否使用',
            '1',
            '1不适用'
        ), 
        2 => array(
            '研究药物 奥沙利铂/给药日期',
            '2'
        ), 
        3 => array(
            '研究药物 奥沙利铂/计划剂量(mg)',
            '0',
        ), 
        4 => array(
            '研究药物 奥沙利铂/总给药剂量(mg)',
            '0'
        )
    ),
);

$data_crf['zq1_2'] = array(
    '#name' => '第一周期/伴随治疗',
    1 => array(
        1 => array(
            '伴随治疗',
            '1',
            '1无'
        )
    ),
    2 => array(
        1 => array(
            '药品通用名 1',
            '2'
        ), 
        2 => array(
            '用法 1',
            '2'
        ), 
        3 => array(
            '给要途径 1',
            '1',
            '0无;1静脉注射;2皮内注射;3皮下注射;4口服给药;5肌肉注射'
        ), 
        4 => array(
            '治疗类别针对 1',
            '1',
            '0化疗预防;1针对不良反应'
        ), 
        5 => array(
            '适应症 1',
            '2',
        ), 
        6 => array(
            '开始日期 1',
            '2'
        ), 
        7 => array(
            '结束日期 1',
            '2'
        ), 
        8 => array(
            '继续 1',
            '1',
            '1继续'
        )
    ),
    3 => array(
        1 => array(
            '药品通用名 2',
            '2'
        ), 
        2 => array(
            '用法 2',
            '2'
        ), 
        3 => array(
            '给要途径 2',
            '1',
            '0无;1静脉注射;2皮内注射;3皮下注射;4口服给药;5肌肉注射'
        ), 
        4 => array(
            '治疗类别针对 2',
            '1',
            '0化疗预防;1针对不良反应'
        ), 
        5 => array(
            '适应症 2',
            '2',
        ), 
        6 => array(
            '开始日期 2',
            '2'
        ), 
        7 => array(
            '结束日期 2',
            '2'
        ), 
        8 => array(
            '继续 2',
            '1',
            '1继续'
        )
    ),
    4 => array(
        1 => array(
            '药品通用名 3',
            '2'
        ), 
        2 => array(
            '用法 3',
            '2'
        ), 
        3 => array(
            '给要途径 3',
            '1',
            '0无;1静脉注射;2皮内注射;3皮下注射;4口服给药;5肌肉注射'
        ), 
        4 => array(
            '治疗类别针对 3',
            '1',
            '0化疗预防;1针对不良反应'
        ), 
        5 => array(
            '适应症 3',
            '2',
        ), 
        6 => array(
            '开始日期 3',
            '2'
        ), 
        7 => array(
            '结束日期 3',
            '2'
        ), 
        8 => array(
            '继续 3',
            '1',
            '1继续'
        )
    ),
    5 => array(
        1 => array(
            '药品通用名 4',
            '2'
        ), 
        2 => array(
            '用法 4',
            '2'
        ), 
        3 => array(
            '给要途径 4',
            '1',
            '0无;1静脉注射;2皮内注射;3皮下注射;4口服给药;5肌肉注射'
        ), 
        4 => array(
            '治疗类别针对 4',
            '1',
            '0化疗预防;1针对不良反应'
        ), 
        5 => array(
            '适应症 4',
            '2',
        ), 
        6 => array(
            '开始日期 4',
            '2'
        ), 
        7 => array(
            '结束日期 4',
            '2'
        ), 
        8 => array(
            '继续 4',
            '1',
            '1继续'
        )
    ),
    6 => array(
        1 => array(
            '药品通用名 5',
            '2'
        ), 
        2 => array(
            '用法 5',
            '2'
        ), 
        3 => array(
            '给要途径 5',
            '1',
            '0无;1静脉注射;2皮内注射;3皮下注射;4口服给药;5肌肉注射'
        ), 
        4 => array(
            '治疗类别针对 5',
            '1',
            '0化疗预防;1针对不良反应'
        ), 
        5 => array(
            '适应症 5',
            '2',
        ), 
        6 => array(
            '开始日期 5',
            '2'
        ), 
        7 => array(
            '结束日期 5',
            '2'
        ), 
        8 => array(
            '继续 5',
            '1',
            '1继续'
        )
    ),
    7 => array(
        1 => array(
            '药品通用名 6',
            '2'
        ), 
        2 => array(
            '用法 6',
            '2'
        ), 
        3 => array(
            '给要途径 6',
            '1',
            '0无;1静脉注射;2皮内注射;3皮下注射;4口服给药;5肌肉注射'
        ), 
        4 => array(
            '治疗类别针对 6',
            '1',
            '0化疗预防;1针对不良反应'
        ), 
        5 => array(
            '适应症 6',
            '2',
        ), 
        6 => array(
            '开始日期 6',
            '2'
        ), 
        7 => array(
            '结束日期 6',
            '2'
        ), 
        8 => array(
            '继续 6',
            '1',
            '1继续'
        )
    ),
    8 => array(
        1 => array(
            '药品通用名 7',
            '2'
        ), 
        2 => array(
            '用法 7',
            '2'
        ), 
        3 => array(
            '给要途径 7',
            '1',
            '0无;1静脉注射;2皮内注射;3皮下注射;4口服给药;5肌肉注射'
        ), 
        4 => array(
            '治疗类别针对 7',
            '1',
            '0化疗预防;1针对不良反应'
        ), 
        5 => array(
            '适应症 7',
            '2',
        ), 
        6 => array(
            '开始日期 7',
            '2'
        ), 
        7 => array(
            '结束日期 7',
            '2'
        ), 
        8 => array(
            '继续 7',
            '1',
            '1继续'
        )
    ),
    9 => array(
        1 => array(
            '药品通用名 8',
            '2'
        ), 
        2 => array(
            '用法 8',
            '2'
        ), 
        3 => array(
            '给要途径 8',
            '1',
            '0无;1静脉注射;2皮内注射;3皮下注射;4口服给药;5肌肉注射'
        ), 
        4 => array(
            '治疗类别针对 8',
            '1',
            '0化疗预防;1针对不良反应'
        ), 
        5 => array(
            '适应症 8',
            '2',
        ), 
        6 => array(
            '开始日期 8',
            '2'
        ), 
        7 => array(
            '结束日期 8',
            '2'
        ), 
        8 => array(
            '继续 8',
            '1',
            '1继续'
        )
    ),
    10 => array(
        1 => array(
            '药品通用名 9',
            '2'
        ), 
        2 => array(
            '用法 9',
            '2'
        ), 
        3 => array(
            '给要途径 9',
            '1',
            '0无;1静脉注射;2皮内注射;3皮下注射;4口服给药;5肌肉注射'
        ), 
        4 => array(
            '治疗类别针对 9',
            '1',
            '0化疗预防;1针对不良反应'
        ), 
        5 => array(
            '适应症 9',
            '2',
        ), 
        6 => array(
            '开始日期 9',
            '2'
        ), 
        7 => array(
            '结束日期 9',
            '2'
        ), 
        8 => array(
            '继续 9',
            '1',
            '1继续'
        )
    ),
    11 => array(
        1 => array(
            '药品通用名 10',
            '2'
        ), 
        2 => array(
            '用法 10',
            '2'
        ), 
        3 => array(
            '给要途径 10',
            '1',
            '0无;1静脉注射;2皮内注射;3皮下注射;4口服给药;5肌肉注射'
        ), 
        4 => array(
            '治疗类别针对 10',
            '1',
            '0化疗预防;1针对不良反应'
        ), 
        5 => array(
            '适应症 10',
            '2',
        ), 
        6 => array(
            '开始日期 10',
            '2'
        ), 
        7 => array(
            '结束日期 10',
            '2'
        ), 
        8 => array(
            '继续 10',
            '1',
            '1继续'
        )
    ),
);

$data_crf['zq2_1'] = zq2_1_x('一');
$data_crf['zq2_2'] = zq2_2_x('一');
$data_crf['zq2_3'] = zq2_3_x('二');
$data_crf['zq2_4'] = zq2_4_x('一', '二');
$data_crf['zq2_5'] = $data_crf['zq1_2'];

//3 4 5 6 7表 = 2表
for($i=3; $i<=7; $i++) {
  $data_crf["zq{$i}_5"] = $data_crf['zq2_5'];
}

$data_crf["zq3_1"] = zq2_1_x('二');
$data_crf["zq3_2"] = zq2_2_x('二');
$data_crf["zq3_3"] = zq2_3_x('三');
$data_crf["zq3_4"] = zq2_4_x('二', '三');

$data_crf["zq4_1"] = zq2_1_x('三');
$data_crf["zq4_2"] = zq2_2_x('三');
$data_crf["zq4_3"] = zq2_3_x('四');
$data_crf["zq4_4"] = zq2_4_x('三', '四');

$data_crf["zq5_1"] = zq2_1_x('四');
$data_crf["zq5_2"] = zq2_2_x('四');
$data_crf["zq5_3"] = zq2_3_x('五');
$data_crf["zq5_4"] = zq2_4_x('四', '五');

$data_crf["zq6_1"] = zq2_1_x('五');
$data_crf["zq6_2"] = zq2_2_x('五');
$data_crf["zq6_3"] = zq2_3_x('六');
$data_crf["zq6_4"] = zq2_4_x('五', '六');

$data_crf["zq7_1"] = zq2_1_x('六');
$data_crf["zq7_2"] = zq2_2_x('六');
$data_crf["zq7_3"] = zq2_3_x('七');
$data_crf["zq7_4"] = zq2_4_x('六', '七');

//8为4个表
$data_crf['zq8_1'] = zq2_1_x('七');
$data_crf['zq8_2'] = zq2_3_x('八');
$data_crf['zq8_3'] = zq8_3_x('八','七');
$data_crf['zq8_4'] = zq8_4_x('八');

//9-16 table

$data_crf["zq9_1"] = zq2_1_x('八');
$data_crf["zq9_2"] = zq2_3_x('九');
$data_crf["zq9_3"] = zq8_3_x('九','八');
$data_crf["zq9_4"] = zq8_4_x('九');

$data_crf["zq10_1"] = zq2_1_x('九');
$data_crf["zq10_2"] = zq2_3_x('十');
$data_crf["zq10_3"] = zq8_3_x('十','九');
$data_crf["zq10_4"] = zq8_4_x('十');

$data_crf["zq11_1"] = zq2_1_x('十');
$data_crf["zq11_2"] = zq2_3_x('十一');
$data_crf["zq11_3"] = zq8_3_x('十一','十');
$data_crf["zq11_4"] = zq8_4_x('十一');

$data_crf["zq12_1"] = zq2_1_x('十一');
$data_crf["zq12_2"] = zq2_3_x('十二');
$data_crf["zq12_3"] = zq8_3_x('十二','十一');
$data_crf["zq12_4"] = zq8_4_x('十二');

$data_crf["zq13_1"] = zq2_1_x('十二');
$data_crf["zq13_2"] = zq2_3_x('十三');
$data_crf["zq13_3"] = zq8_3_x('十三','十二');
$data_crf["zq13_4"] = zq8_4_x('十三');

$data_crf["zq14_1"] = zq2_1_x('十三');
$data_crf["zq14_2"] = zq2_3_x('十四');
$data_crf["zq14_3"] = zq8_3_x('十四','十三');
$data_crf["zq14_4"] = zq8_4_x('十四');

$data_crf["zq15_1"] = zq2_1_x('十四');
$data_crf["zq15_2"] = zq2_3_x('十五');
$data_crf["zq15_3"] = zq8_3_x('十五','十四');
$data_crf["zq15_4"] = zq8_4_x('十五');

$data_crf["zq16_1"] = zq2_1_x('十五');
$data_crf["zq16_2"] = zq2_3_x('十六');
$data_crf["zq16_3"] = zq8_3_x('十六','十五');
$data_crf["zq16_4"] = zq8_4_x('十六');

$data_crf['zhiliao_js'] = array(
  '#name' => '治疗结束',
    1 => array(
        1 => array(
            '总结日期',
            '2'
        )
    ),
    2 => array(
        1 => array(
            '是否完成治疗计划',
            '1是;0否'
        ), 
        2 => array(
            '完成个给药周期',
            '0'
        )
    ),
    3 => array(
        1 => array(
            '中止日期',
            '2'
        )
    ),
    4 => array(
        1 => array(
            '中止治疗的原因',
            '1',
            '1同时应用研究方案之外的抗肿瘤治疗;2未按方案规定剂量和疗程用药;3受试者出现病情进展;4经剂量调整和药物暂停后受试者毒性仍然无法耐受者;5受试者主动要求退出试验;6研究者认为受试者有必要停止试验;7院外治疗失访;8死亡;9其它'
        ), 
        2 => array(
            '其它请详细说明',
            '2'
        )
    ),
);

$data_crf['xueye_zlbjwjcjghzb'] = array(
  '#name' => '血液肿瘤标记物检测结果汇总表',
    1 => array(
        1 => array(
            '标记物名称',
            '1',
            '0无;1CEA;2CA19-9;3CA72-4'
        ), 
        2 => array(
            '标记物名称是其它',
            '2'
        ), 
        3 => array(
            '结果',
            '2'
        ), 
        4 => array(
            '单位',
            '1',
            '0ng/ml;1U/ml'
        ), 
        5 => array(
            '其它单位',
            '2'
        ), 
        6 => array(
            '取样日期',
            '2'
        )
    ),
);
for($i=2;$i<=12;$i++) {
  for($j=1;$j<=6;$j++) {
    $data_crf['xueye_zlbjwjcjghzb'][$i][$j];
  }
}

$data_crf['yanzhong_blsjjl'] = array(
  '#name' => '严重不良事件记录1',
    1 => array(
        1 => array(
            '报告日期',
            '2'
        )
    ),
    2 => array(
        1 => array(
            '报告来源',
            '1',
            '1患者;2家属;3研究者;4其它'
        ), 
        2 => array(
            '其它报告来源请说明',
            '2'
        )
    ),
    3 => array(
        1 => array(
            '单位名称',
            '2'
        ), 
        2 => array(
            '联系电话',
            '2'
        )
    ),
    4 => array(
        1 => array(
            '联系地址',
            '2'  
        ), 
        2 => array(
            '邮编',
            '2'  
        )
    ),
    5 => array(
        1 => array(
            '患者资料/患者姓名',
            '2' 
        ), 
        2 => array(
            '患者资料/年龄',
            '2' 
        ), 
        3 => array(
            '患者资料/性别',
            '1',
        ),
    ),
    6 => array(
        1 => array(
            '事件主要表现',
            '2'
        )
    ),
    7 => array(
        1 => array(
            '事件发生日期',
            '2'
        )
    ),
    8 => array(
        1 => array(
            '事件发生场所',
            '1',
            '1医院;2诊所;3家庭;4工作单位;5其它'
        ), 
        2 => array(
            '事件发生场所选择其它需说明',
            '2'
        )
    ),
    9 => array(
        1 => array(
            '事件后果',
            '1',
            '1必须住院治疗或者延长住院时间;2致畸/出生缺陷;3危及生命;4永久性的或严重的残疾/功能障碍;5重大医疗事故;6死亡'
        ), 
        2 => array(
            '死亡时间',
            '2'
        )
    ),
    10 => array(
        1 => array(
            '报告人',
            '1',
            '1医师;2技师;3护士;4其它'
        ), 
        2 => array(
            '其他报告人',
            '2',
        )
    ),
    11 => array(
        1 => array(
            '药物具体名称',
            '2',
        )
    ),
    12 => array(
        1 => array(
            '生产企业名称',
            '2',
        ), 
        2 => array(
            '型号规格',
            '2',
        ), 
        3 => array(
            '生产企业地址',
            '2',
        ), 
        4 => array(
            '产品编号',
            '2',
        ), 
        5 => array(
            '企业联系电话',
            '2',
        ), 
        6 => array(
            '产品批号',
            '2',
        )
    ),
    13 => array(
        1 => array(
            '有效期至',
            '2',
        ), 
        2 => array(
            '停用日期',
            '2',
        )
    ),
    14 => array(
        1 => array(
            '事件发生原因分析',
            '2',        
        )
    ),
    15 => array(
        1 => array(
            '事件处理情况',
            '2',
        )
    ),
    16 => array(
        1 => array(
            '事件报告状态',
            '1',
            '1已通知医院;2已通知企业;3已通知本地药监分局'
        )
    ),
    17 => array(
        1 => array(
            '严重不良事件评价及与治疗药物关系',
            '1',
            '1肯定有关;2很可能有关;3可能有关;4可能无关;5无关'
        )
    ),
    18 => array(
        1 => array(
            '报告人签名',
            '2'
        ), 
        2 => array(
            '日期',
            '2'
        )
    ),
);

$data_crf['yanzhong_blsjjl_1'] = $data_crf['yanzhong_blsjjl'];
$data_crf['yanzhong_blsjjl_1']['#name'] = '严重不良事件记录2';

for($i=1; $i<=5; $i++) {
// the second file
  $data_crf["pg{$i}_1"] = array(
    '#name' => '第'.$i.'次体格检查',
      1 => array(
          1 => array(
              '检查日期',
              '2'
          )
      ),
      2 => array(
          1 => array(
              '体重(kg)',
              '0'
          ), 
          2 => array(
              'ECOG PS评分',
              '1',
              '00;11;22'
          )
      ),
      3 => array(
          1 => array(
              '过去3月内体重减轻(%)',
              '2'
          ), 
          2 => array(
              '血压 1',
              '0',
              '单位mmHg'
          ), 
          3 => array(
              '血压 2',
              '0',
              '单位mmHg'
          )
      ),
      4 => array(
          1 => array(
              '生命体征',
              '1',
              '0未做;1正常;2异常无临床意义;3异常有临床意义',
          ), 
          2 => array(
              '生命体征说明',
              '2'
          )
      ),
      5 => array(
          1 => array(
              '体格检查',
              '1',
              '0未做;1正常;2异常无临床意义;3异常有临床意义',
          ), 
          2 => array(
              '体格检查说明',
              '2'
          )
      ),
      6 => array(
          1 => array(
              '食欲',
              '1',
              '0很差;1差;2尚可;3较好;4良好',
          )
      ),
      7 => array(
          1 => array(
              '神经系统检查',
              '1',
              '0未做;1正常;2异常无临床意义;3异常有临床意义',
          ), 
          2 => array(
              '神经系统检查说明',
              '2'
          )
      ),
  );
  $data_crf["pg{$i}_2"] = array(
    '#name' => '第'.$i.'次心电图检查',
      1 => array(
          1 => array(
              '是否做第'.$i.'次心电图检查',
              '1',
              '1未做'
          )
      ),
      2 => array(
          1 => array(
              '检查日期',
              '2'
          )
      ),
      3 => array(
          1 => array(
              '检查结果',
              '1',
              '0正常;1异常'
          ), 
          2 => array(
              '检查结果异常说明',
              '2'
          )
      ),
  );

  $data_crf["pg{$i}_3"] = array(
  '#name' => '第'.$i.'次肿瘤评估',
    1 => array(
        1 => array(
            '是否做第'.$i.'肿瘤评估',
            '1',
            '1未做'
        )
    ),
    2 => array(
        1 => array(
            '方法',
            '1',
            '0无;1CT;2MRI','3PET-CT','4X-Ray','5B超','6内镜','7组织学和/或细胞学检查'
        ), 
        2 => array(
            '部位',
            '2'
        ), 
        3 => array(
            '结果描述/说明',
            '2'            
        ), 
        4 => array(
            '日期',
            '2'            
        )
    ),
    3 => array(
        1 => array(
            '方法',
            '1',
            '0无;1CT;2MRI','3PET-CT','4X-Ray','5B超','6内镜','7组织学和/或细胞学检查'
        ), 
        2 => array(
            '部位',
            '2'
        ), 
        3 => array(
            '结果描述/说明',
            '2'            
        ), 
        4 => array(
            '日期',
            '2'            
        )
    ),
    4 => array(
        1 => array(
            '方法',
            '1',
            '0无;1CT;2MRI','3PET-CT','4X-Ray','5B超','6内镜','7组织学和/或细胞学检查'
        ), 
        2 => array(
            '部位',
            '2'
        ), 
        3 => array(
            '结果描述/说明',
            '2'            
        ), 
        4 => array(
            '日期',
            '2'            
        )
    ),
    5 => array(
        1 => array(
            '方法',
            '1',
            '0无;1CT;2MRI','3PET-CT','4X-Ray','5B超','6内镜','7组织学和/或细胞学检查'
        ), 
        2 => array(
            '部位',
            '2'
        ), 
        3 => array(
            '结果描述/说明',
            '2'            
        ), 
        4 => array(
            '日期',
            '2'            
        )
    ),
    6 => array(
        1 => array(
            '方法',
            '1',
            '0无;1CT;2MRI','3PET-CT','4X-Ray','5B超','6内镜','7组织学和/或细胞学检查'
        ), 
        2 => array(
            '部位',
            '2'
        ), 
        3 => array(
            '结果描述/说明',
            '2'            
        ), 
        4 => array(
            '日期',
            '2'            
        )
    ),
    7 => array(
        1 => array(
            '方法',
            '1',
            '0无;1CT;2MRI','3PET-CT','4X-Ray','5B超','6内镜','7组织学和/或细胞学检查'
        ), 
        2 => array(
            '部位',
            '2'
        ), 
        3 => array(
            '结果描述/说明',
            '2'            
        ), 
        4 => array(
            '日期',
            '2'            
        )
    ),
    8 => array(
        1 => array(
            '方法',
            '1',
            '0无;1CT;2MRI','3PET-CT','4X-Ray','5B超','6内镜','7组织学和/或细胞学检查'
        ), 
        2 => array(
            '部位',
            '2'
        ), 
        3 => array(
            '结果描述/说明',
            '2'            
        ), 
        4 => array(
            '日期',
            '2'            
        )
    ),
    9 => array(
        1 => array(
            '方法',
            '1',
            '0无;1CT;2MRI','3PET-CT','4X-Ray','5B超','6内镜','7组织学和/或细胞学检查'
        ), 
        2 => array(
            '部位',
            '2'
        ), 
        3 => array(
            '结果描述/说明',
            '2'            
        ), 
        4 => array(
            '日期',
            '2'            
        )
    ),
    10 => array(
        1 => array(
            '方法',
            '1',
            '0无;1CT;2MRI','3PET-CT','4X-Ray','5B超','6内镜','7组织学和/或细胞学检查'
        ), 
        2 => array(
            '部位',
            '2'
        ), 
        3 => array(
            '结果描述/说明',
            '2'            
        ), 
        4 => array(
            '日期',
            '2'            
        )
    ),
  );

  $data_crf["pg{$i}_4"] = array(
    '#name' => '第'.$i.'次血液肿瘤标记物检测',
      1 => array(
          1 => array(
              '是否做血液肿瘤标记物检测',
              '1',
              '1未做'
          )
      ),
      2 => array(
          '#name' => '血清CEA',
          1 => array(
              '项目',
              '1',
              '1未做'
          ), 
          2 => array(
              '结果',
              '2',
          ), 
          3 => array(
              '单位',
              '1',
              '0ng/ml;1其它'
          ), 
          4 => array(
              '单位为其它说明',
              '2'
          ), 
          5 => array(
              '取样日期',
              '2'
          )
      ),
      3 => array(
          '#name' => '血清CA19-9',
          1 => array(
              '项目',
              '1',
              '1未做'
          ), 
          2 => array(
              '结果',
              '2',
          ), 
          3 => array(
              '单位',
              '2'
          ), 
          4 => array(
              '取样日期',
              '2'
          )
      ),
      4 => array(
          '#name' => '血清CA724',
          1 => array(
              '项目',
              '1',
              '1未做'
          ), 
          2 => array(
              '结果',
              '2',
          ), 
          3 => array(
              '单位',
              '2'
          ), 
          4 => array(
              '取样日期',
              '2'
          )
      ),
  );

  $data_crf["pg{$i}_5"] = array(
    '#name' => '第'.$i.'次检查肿瘤是否进展/复发/转移？',
      1 => array(
          1 =>  array(
              '是否已将诊断肿瘤进展的相关检查填入上述表中',
              '1',
              '0否;1是'
          )
      ),
  );

  $data_crf["pg{$i}_6"] = $data_crf['shiyan_sjc'];
  $data_crf["pg{$i}_6"]['#name'] = '第'.$n.'次临床评估的实验室检查';
}

for ($i=1; $i<=9; $i++) {
  $data_crf["sf{$i}_1"] = array(
    '#name' => '随访'.$i.'的患者状态',
      1 => array(
          1 =>  array(
              '随访日期',
              '2'
          )
      ),
      2 => array(
          1 =>  array(
              '随访方法',
              '1',
              '0办公室/医院随访;1电话/写信或其它联系方式'
          )
      ),
      3 => array(
          1 =>  array(
              '患者状态',
              '1',
              '0存活;1死亡，请填写<b>死亡报告表</b>;2失访'
          )
      ),
  );
  $data_crf["sf{$i}_2"] = array(
    '#name' => '随访'.$i.'的疾病状况',
      1 => array(
          1 => array(
              '疾病状况',
              '1',
              '1已报告疾病进展;2本次随访时发现疾病进展（请填写下<b>述肿瘤评估表</b>）;3没有进展;4未知/不适用'
          )
      ),
  );

  $data_crf["sf{$i}_3"] = array(
    '#name' => '随访'.$i.'的肿瘤评估',
      1 => array(
          1 => array(
              '是否做此次肿瘤评估',
              '1',
              '1未做'
          )
      ),
      2 => array(
          1 => array(
              '方法',
              '1',
              "0无;1CT;2MRI;3PET-CT;4X-Ray;5B超;6内镜;7组织学和/或细胞学检查"
          ), 
          2 => array(
              '部位',
              '2'
          ), 
          3 => array(
              '结果',
              '2'
          ), 
          4 => array(
              '日期',
              '2'
          )
      ),
      3 => array(
          1 => array(
              '方法',
              '1',
              "0无;1CT;2MRI;3PET-CT;4X-Ray;5B超;6内镜;7组织学和/或细胞学检查"
          ), 
          2 => array(
              '部位',
              '2'
          ), 
          3 => array(
              '结果',
              '2'
          ), 
          4 => array(
              '日期',
              '2'
          )
      ),
      4 => array(
          1 => array(
              '方法',
              '1',
              "0无;1CT;2MRI;3PET-CT;4X-Ray;5B超;6内镜;7组织学和/或细胞学检查"
          ), 
          2 => array(
              '部位',
              '2'
          ), 
          3 => array(
              '结果',
              '2'
          ), 
          4 => array(
              '日期',
              '2'
          )
      ),
      5 => array(
          1 => array(
              '方法',
              '1',
              "0无;1CT;2MRI;3PET-CT;4X-Ray;5B超;6内镜;7组织学和/或细胞学检查"
          ), 
          2 => array(
              '部位',
              '2'
          ), 
          3 => array(
              '结果',
              '2'
          ), 
          4 => array(
              '日期',
              '2'
          )
      ),
      6 => array(
          1 => array(
              '方法',
              '1',
              "0无;1CT;2MRI;3PET-CT;4X-Ray;5B超;6内镜;7组织学和/或细胞学检查"
          ), 
          2 => array(
              '部位',
              '2'
          ), 
          3 => array(
              '结果',
              '2'
          ), 
          4 => array(
              '日期',
              '2'
          )
      ),
      7 => array(
          1 => array(
              '方法',
              '1',
              "0无;1CT;2MRI;3PET-CT;4X-Ray;5B超;6内镜;7组织学和/或细胞学检查"
          ), 
          2 => array(
              '部位',
              '2'
          ), 
          3 => array(
              '结果',
              '2'
          ), 
          4 => array(
              '日期',
              '2'
          )
      ),
      8 => array(
          1 => array(
              '方法',
              '1',
              "0无;1CT;2MRI;3PET-CT;4X-Ray;5B超;6内镜;7组织学和/或细胞学检查"
          ), 
          2 => array(
              '部位',
              '2'
          ), 
          3 => array(
              '结果',
              '2'
          ), 
          4 => array(
              '日期',
              '2'
          )
      ),
      9 => array(
          1 => array(
              '方法',
              '1',
              "0无;1CT;2MRI;3PET-CT;4X-Ray;5B超;6内镜;7组织学和/或细胞学检查"
          ), 
          2 => array(
              '部位',
              '2'
          ), 
          3 => array(
              '结果',
              '2'
          ), 
          4 => array(
              '日期',
              '2'
          )
      ),
  );
}

$data_crf['siwang_jl'] = array(
  '#name' => '死亡记录',
    1 => array(
        1 => array(
            '死亡日期',
            '2'
        )
    ),
    2 => array(
        1 => array(
            '原发肿瘤',
            '1',
            '1有原发肿瘤'
        ),
    ),
    3 => array(
        1 => array(
            '其它疾病',
            '1',
            '1有其它疾病'
        ), 
        2 => array(
            '其它疾病请说明',
            '2'
        )
    ),
    4 => array(
        1 => array(
            '其它原因',
            '1',
            '有其它原因'
        ), 
        2 => array(
            '其它原因请说明',
            '2'
        )
    ),
    5 => array(
        1 => array(
            '原因不明',
            '1',
            '1是原因不明'
        ), 
        2 => array(
            '原因不明请描述',
            '2'
        )
    ),
);

$data_crf['yanjiu_js'] = array(
  '#name' => '研究结束',
    1 => array(
        1 => array(
            '研究结束日期',
            '2'
        )
    ),
    2 => array(
        1 => array(
            '是否完成研究随访',
            '1',
            '1完成研究随访'
        ),
    ),
    3 => array(
        1 => array(
            '是否撤回知情同意',
            '1',
            '1撤回知情同意'
        ),
    ),
    4 => array(
        1 => array(
            '是否由于搬迁、转院、繁忙等原因难以继续进行研究',
            '1',
            '1由于搬迁、转院、繁忙等原因难以继续进行研究'
        ),
    ),
    5 => array(
        1 => array(
            '是否死亡',
            '1',
            '1死亡'
        ),
    ),
    6 => array(
        1 => array(
            '是否有其它原因',
            '1',
            '1有其它原因'
        ), 
        2 => array(
            '其它原因说明',
            '2'
        )
    ),
    7 => array(
        1 => array(
            '研究者签名',
            '2'
        )
    ),
    8 => array(
        1 => array(
            '签名日期',
            '2'
        )
    ),
);


function zq2_1_x($n) {
  $arr = array(
      '#name' => '第'.$n.'周期化疗不良事件',
      1 => array(
          1 => array(
              '无不良事件',
              '1',
              '1无'
          )
      ),
      2 => array(
          '#name' => '血红蛋白（g/L）',
          1 => array(
              '最严重时分级',
              '1',
              '0I;1II;2III;3IV'
          ), 
          2 => array(
              '处理措施',
              '1',
              '0无;1继续用药;2减少用量;3暂停后继续用药;4停药;5其它'
          ),
          3 => array(
              '最严重时分级 选择其它需说明',
            '2'
          ), 
          4 => array(
              '最严重时分级 选择停药需说明',
            '2'
          ), 
          5 => array(
              '转归',
              '1',
              '0无;1消失;2改善;3无改善;4加重'
          ), 
          6 => array(
              '与研究药物关系',
              '1',
              '0无;1肯定有关;2很可能有关;3可能有关;4可能无关;5肯定无关'
          )
      ),
      3 => array('#name' => '白细胞（10<sup>9</sup>/L）'),
      4 => array('#name' => '粒细胞（10<sup>9</sup>/L）'),
      5 => array('#name' => '血小板（10<sup>9</sup>/L）'),
      6 => array('#name' => '胆红素（mg/dL）'),
      7 => array('#name' => 'ALT（IU/L）'),
      8 => array('#name' => 'AST（IU/L）'),
      9 => array('#name' => 'ALP（IU/L）'),
      10 => array('#name' => 'BUN（mmol/L）'),
      11 => array('#name' => 'Cr（µmol/L）'),
      12 => array('#name' => '出血'),
      13 => array('#name' => '血尿'),
      14 => array('#name' => '口腔炎'),
      15 => array('#name' => '恶心、呕吐'),
      16 => array('#name' => '腹泻'),
      17 => array('#name' => '药物致发热'),
      18 => array('#name' => '脱发'),
      19 => array('#name' => '过敏'),
      20 => array('#name' => '皮肤'),
      21 => array('#name' => '肺部'),
      22 => array('#name' => '心脏'),
      23 => array('#name' => '神志'),
      24 => array('#name' => '周围神经'),
      25 => array('#name' => '便秘'),
      26 => array('#name' => '局部静脉'),
      27 => array(
          '#name' => '其它 1',
          1 => array(
              '其它项目名称',
              '2',
          ), 
          2 => array(
              '最严重时分级',
              '1',
              '0I;1II;2III;3IV'
          ), 
          3 => array(
              '处理措施',
              '1',
              '0无;1继续用药;2减少用量;3暂停后继续用药;4停药;5其它'
          ),
          4 => array(
              '最严重时分级 选择其它需说明',
            '2'
          ), 
          5 => array(
              '最严重时分级 选择停药需说明',
            '2'
          ), 
          6 => array(
              '转归',
              '1',
              '0无;1消失;2改善;3无改善;4加重'
          ), 
          7 => array(
              '与研究药物关系',
              '1',
              '0无;1肯定有关;2很可能有关;3可能有关;4可能无关;5肯定无关'
          )
      ),
      28 => array('#name' => '其它 2'),
      29 => array('#name' => '其它 3'),
  );
  for($i=3;$i<=26;$i++) {
    for($j=1;$j<=6;$j++) {
      $arr[$i][$j] = $arr[2][$j];
    }
  }
  for($i=28;$i<=29;$i++) {
    for($j=1;$j<=7;$j++) {
      $arr[$i][$j] = $arr[27][$j];
    }
  }
  return $arr;
}

function zq2_2_x($n) {
  return array(
    '#name' => '第'.$n.'周期研究治疗是否发生减量/或延迟用药？',
    1 => array(
        1 => array(
            '是否发生',
            '1',
            '1否，请跳过本表'
        )
    ),  
    2 => array(
        1 => array(
            '奥沙利铂',
            '1',
            '1有发生'
        ), 
        2 => array(
            '奥沙利铂 减量或延迟',
            '1',
            '1减量;2延迟'
        ), 
        3 => array(
            '奥沙利铂 减量或延迟 主要原因',
            '2'
        )
    ),
    3 => array(      
        1 => array(
            'S-1',
            '1',
            '1有发生'
        ), 
        2 => array(
            'S-1 减量或延迟',
            '1',
            '1减量;2延迟'
        ), 
        3 => array(
            'S-1 减量或延迟 主要原因',
            '2'
        )
    ),
  );
}

function zq2_3_x($n) {
  return array(
  '#name' => '第'.$n.'周期化疗前主要实验室检查结果',
  1 => array(
      1 => array(
          '未做',
          '1',
          '1未做，跳过本表'
      )
  ),
  2 => array(
      '#name' => '中性粒细胞计数',
      1 => array(
          '数值',
          '0'
      ), 
      2 => array(
          '单位',
          '1',
          '0x10<sup>3</sup>/mm<sup>3</sup>;1x10<sup>9</sup>/L'
      ), 
      3 => array(
          '是否有临床意义？',
          '1',
          '1是;0否'
      ), 
      4 => array(
          '取样日期',
          '2'
      )
  ),  
  3 => array(
      '#name' => '血小板计数',
      1 => array(
          '数值',
          '0'
      ), 
      2 => array(
          '单位',
          '1',
          '0x10<sup>3</sup>/mm<sup>3</sup>;1x10<sup>9</sup>/L'
      ), 
      3 => array(
          '是否有临床意义？',
          '1',
          '1是;0否'
      ), 
      4 => array(
          '取样日期',
          '2'
      )
  ), 
  4 => array(
      '#name' => '血肌酐清除率',
      1 => array(
          '数值',
          '0'
      ), 
      2 => array(
          '单位',
          '1',
          '0ml/min;1其它'
      ), 
      3 => array(
          '单位如选择其它需说明',
          '2'
      ),
      4 => array(
          '是否有临床意义？',
          '1',
          '1是;0否'
      ), 
      5 => array(
          '取样日期',
          '2'
      )
  ), 
  5 => array(
      '#name' => '其它 1',
      1 => array(
          '参数',
          '0'
      ), 
      2 => array(
          '数值',
          '0'
      ), 
      3 => array(
          '单位',
          '0'
      ),
      4 => array(
          '是否有临床意义？',
          '1',
          '1是;0否'
      ), 
      5 => array(
          '取样日期',
          '2'
      )
  ),
  6 => array(
      '#name' => '其它 2',
      1 => array(
          '参数',
          '0'
      ), 
      2 => array(
          '数值',
          '0'
      ), 
      3 => array(
          '单位',
          '0'
      ),
      4 => array(
          '是否有临床意义？',
          '1',
          '1是;0否'
      ), 
      5 => array(
          '取样日期',
          '2'
      )
  ),
  7 => array(
      '#name' => '其它 3',
      1 => array(
          '参数',
          '0'
      ), 
      2 => array(
          '数值',
          '0'
      ), 
      3 => array(
          '单位',
          '0'
      ),
      4 => array(
          '是否有临床意义？',
          '1',
          '1是;0否'
      ), 
      5 => array(
          '取样日期',
          '2'
      )
  ),
);
}

function zq2_4_x($n1, $n2){
  return array(
    '#name' => '第'.$n2.'周期/研究给药',
      1 => array(
          '#name' => 'S-1',
          1 => array(
              '第'. $n1 .'周期给药记录/实际总量',
              '0'
          ), 
          2 => array(
              '第'. $n1 .'周期给药记录/剂量强度',
              '2'
          ), 
          3 => array(
              '第'. $n2 .'周期给药计划/给药起始日期',
              '2'
          ), 
          4 => array(
              '第'. $n2 .'周期给药计划/给药结束日期',
              '2'
          ), 
          5 => array(
              '第'. $n2 .'周期给药计划/计划剂量',
              '1',
              '040;150;260'
          ), 
          6 => array(
              '第'. $n2 .'周期给药计划/计划总量',
              '0'
          )
      ),
      2 => array(
          '#name' => '奥沙利铂',
          1 => array(
              '不适用',
              '1',
              '1不适用'
          ), 
          2 => array(
              '第'. $n1 .'周期给药记录/实际总量',
              '0'
          ), 
          3 => array(
              '第'. $n1 .'周期给药记录/剂量强度',
              '2'
          ), 
          4 => array(
              '第'. $n2 .'周期给药计划/给药日期',
              '2'
          ), 
          5 => array(
              '第'. $n2 .'周期给药计划/计划剂量',
              '0',
          ), 
          6 => array(
              '第'. $n2 .'周期给药计划/计划总量',
              '0'
          )
      ),
  );
}

function zq8_3_x($n1,$n2) {
   return array(
    '#name' => '第'.$n1.'周期研究给药',
      1 => array(
          '#name' => '第'.$n2.'周期S-1研究给药',
          1 => array(
              '实际给药总量',
              '0'
          ), 
          2 => array(
              '剂量强度为',
              '2'
          )
      ),
      2 => array(
          '#name' => '第'.$n2.'周期S-1研究给药',
          1 => array(
              '是否发生减量/或延迟给药？',
              '1',
              '1是;0否'
          ), 
          2 => array(
              '发生减量/或延迟给药的原因',
              '2'
          )
      ),
      3 => array(
          '#name' => '第'.$n1.'周期S-1给药计划',
          1 => array(
              '给药起始日期',
              '2'
          ), 
          2 => array(
              '给药结束日期',
              '2'
          )
      ),
      4 => array(
          '#name' => '第'.$n1.'周期S-1给药计划',
          1 => array(
              '计划剂量(mg)',
              '1',
              '040;150;260'
          ), 
          2 => array(
              '计划总量(mg)',
              '0',
          )
      ),
  ); 
}

function zq8_4_x($n) {
  $arr = array(
      '#name' => '第'.$n.'周期伴随治疗',
      1 => array(
          1 => array(
              '是否有伴随治疗',
              '1',
              '1无'
          )
      ),
      2 => array(
          1 => array(
              '药品通用名',
              '2'
          ), 
          2 => array(
              '用法',
              '2'
          ), 
          3 => array(
              '给药途径',
              '1',
              '0无;1静脉注射;2皮内注射;3皮下注射;4口服给药;5肌肉注射'
          ), 
          4 => array(
              '治疗类别',
              '1',
              '0针对化疗预防;1针对不良反应'
          ), 
          5 => array(
              '适应症',
              '2'
          ), 
          6 => array(
              '开始日期',
              '2'
          ), 
          7 => array(
              '结束日期',
              '2'
          ), 
          8 => array(
              '是否继续',
              '1',
              '1是'
          )
      ),
  );
  for($i=3;$i<=11;$i++) {
    for($j=1;$j<=8;$j++) {
      $arr[$i][$j] = $arr[2][$j];
    }
  }
  return $arr;
}